#!/bin/sh
# author:   hoojo
# email:    hoojo_@126.com
# github:   https://github.com/hooj0
# create:   2018-10-19
# copyright by hoojo@2018
# @changelog Added dir `pwd` shell command example



# =================================================================
#		pwd —— 查看当前工作目录
# =================================================================
# pwd — 打印出当前工作目录名
# -----------------------------------------------------------------
#


# =================================================================
#	 示例：pwd 打印出当前工作目录名
# =================================================================
pwd

# output: 输出绝对路径
#-------------------------------------------------------------------
# /d/private_workspace/shell_examples/02_samples_file








read exits