#!/bin/sh
# author:   hoojo
# email:    hoojo_@126.com
# github:   https://github.com/hooj0
# create:   2018-10-19
# copyright by hoojo@2018
# @changelog Added dir `pushd` shell command example



# =================================================================
#		pushd —— 切换到该目录，并将目录加入栈顶部
# =================================================================
#  pushd 命令常用于将目录加入到栈中，加入记录到目录栈顶部，并切换到该目录；
#  若pushd命令不加任何参数，则会将位于记录栈最上面的2个目录对换位置
# -----------------------------------------------------------------
# 语法格式：
# 		pushd  [目录 | -N | +N]   [-n]
# 选项
# 	目录   	将该目录加入到栈顶，并执行"cd 目录"，切换到该目录
# 	+N    	将第N个目录移至栈顶（从左边数起，数字从0开始）
# 	-N    	将第N个目录移至栈顶（从右边数起，数字从0开始）
# 	-n    	将目录入栈时，不切换目录
# -----------------------------------------------------------------




# =================================================================
# 示例：将位于记录栈最上面的2个目录对换位置
# =================================================================
dirs -v

# output:
#-------------------------------------------------------------------
#  0  /d/GoPath/src/github.com
# 1  /d/GoPath/src
# 2  /d/GoPath/src/github.com/hyperledger

# 切换目录
pushd

# output:
#------------------------------------------------------------------- 
# 0  /d/GoPath/src
# 1  /d/GoPath/src/github.com
# 2  /d/GoPath/src/github.com/hyperledger



# =================================================================
# 示例： 将该目录加入到栈顶，并执行"cd 目录"，切换到该目录
# =================================================================
pushd ~

pwd
# /c/Users/Administrator

# output:
#-------------------------------------------------------------------
# ~ /d/GoPath/src /d/GoPath/src/github.com /d/GoPath/src/github.com/hyperledger



# =================================================================
# 示例： 将第N个目录移至栈顶（从左边数起，数字从0开始）
# =================================================================
pushd +1

pwd
# /d/GoPath/src

# output:
#-------------------------------------------------------------------
# /d/GoPath/src /d/GoPath/src/github.com /d/GoPath/src/github.com/hyperledger ~



# =================================================================
# 示例： 将第N个目录移至栈顶（从右边数起，数字从0开始）
# =================================================================
pushd -1

pwd
# /d/GoPath/src/github.com/hyperledger

# output:
#-------------------------------------------------------------------
# /d/GoPath/src/github.com/hyperledger ~ /d/GoPath/src /d/GoPath/src/github.com



# =================================================================
# 示例： 将第N个目录移至栈顶（从右边数起，数字从0开始）
# =================================================================
pushd -n /d

pwd
# /d/GoPath/src/github.com/hyperledger

# output:
#-------------------------------------------------------------------
# /d/GoPath/src/github.com/hyperledger /d ~ /d/GoPath/src /d/GoPath/src/github.com

read exits