#!/bin/sh
# author:   hoojo
# email:    hoojo_@126.com
# github:   https://github.com/hooj0
# create:   2018-10-19
# copyright by hoojo@2018
# @changelog Added dir `dirs` shell command example



# =================================================================
#		dirs —— 显示当前目录栈中的所有记录
# =================================================================
#  dirs 显示当前目录栈中的所有记录（不带参数的dirs命令显示当前目录栈中的记录）
# -----------------------------------------------------------------
# 语法说明：
# 		dirs  [-clpv]  [+n]  [-n]
# 		
# 选项：
#	-c    	删除目录栈中的所有记录
#	-l     	以完整格式显示
#	-p    	一个目录一行的方式显示
#	-v    	每行一个目录来显示目录栈的内容，每个目录前加上的编号
#	
#	+N  	显示从左到右的第n个目录，数字从0开始
#	-N   	显示从右到左的第n个日录，数字从0开始
# 
# 注意：dirs始终显示当然目录, 再是堆栈中的内容；即使目录堆栈为空, 
# dirs命令仍然只显示当然目录
# -----------------------------------------------------------------




# =================================================================
# 示例：显示值栈中所有记录
# =================================================================
dirs
dirs -l

# output:
#-------------------------------------------------------------------
# /d/GoPath/src/github.com /d/GoPath/src /d/GoPath/src/github.com/hyperledger



# =================================================================
# 示例： 每行一个的方式显示
# =================================================================
dirs -p

# output:
#-------------------------------------------------------------------
# /d/GoPath/src/github.com
# /d/GoPath/src
# /d/GoPath/src/github.com/hyperledger



# =================================================================
# 示例： 每行一个目录来显示目录栈的内容，每个目录前加上的编号
# =================================================================
dirs -v

# output:
#-------------------------------------------------------------------
# 0  /d/GoPath/src/github.com
# 1  /d/GoPath/src
# 2  /d/GoPath/src/github.com/hyperledger



# =================================================================
# 示例： 显示从左到右的第n个目录
# =================================================================
dirs +0


# output:
#-------------------------------------------------------------------
# /d/GoPath/src/github.com



# =================================================================
# 示例： 显示从右到左的第n个日录，数字从0开始
# =================================================================
dirs -0


# output:
#-------------------------------------------------------------------
# /d/GoPath/src/github.com/hyperledger


read exits