#!/bin/sh
# author:   hoojo
# email:    hoojo_@126.com
# github:   https://github.com/hooj0
# create:   2018-11-06
# copyright by hoojo@2018



# =================================================================
#		lprm——从打印机任务队列中移除某个任务
# =================================================================
# CUPS 提供两个程序来从打印队列中终止并移除打印任务。
# 一个是 Berkeley 风格的（lprm），另一个是 System V 的（cancel）。
# 在支持的选项上两者有较小的区别但是功能却几乎相同。
# -----------------------------------------------------------------




# =================================================================
# 示例：取消打印任务
# =================================================================
# 移除打印任务
cancel 603

# 或者 移除打印任务
lprm

# 查看打印机
lpq

# output:
#-------------------------------------------------------------------
# printer is ready
# no entries







