#!/bin/sh

# =================================================================
#		cp——复制文件
# =================================================================
# 把一个文件从一个位置复制到另外一个位置。
# 上面 filename1 是源文件位置， filename2 是目标位置（精确到文件名）。
# -----------------------------------------------------------------
# 语法
#   cp [options] source dest
#   或 cp [options] source... directory
#
# 参数说明：
#
#   -a：此选项通常在复制目录时使用，它保留链接、文件属性，并复制目录下的所有内容。其作用等于dpR参数组合。
#   -d：复制时保留链接。这里所说的链接相当于Windows系统中的快捷方式。
#   -f：覆盖已经存在的目标文件而不给出提示。
#   -i：与-f选项相反，在覆盖目标文件之前给出提示，要求用户确认是否覆盖，回答"y"时目标文件将被覆盖。
#   -p：除复制文件的内容外，还把修改时间和访问权限也复制到新文件中。
#   -r：若给出的源文件是一个目录文件，此时将复制该目录下所有的子目录和文件。
#   -l：不复制文件，只是生成链接文件。
# -----------------------------------------------------------------




# =================================================================
#	 示例1：复制目录，保留链接、文件属性，并复制目录下的所有内容
# =================================================================
cp -a src dst



# =================================================================
#	 示例2：覆盖已经存在的目标文件
# =================================================================
cp -f a.txt d.txt




# =================================================================
#	 示例3：复制目录下的所有目录和文件
# =================================================================
cp -r a.txt d.txt




# =================================================================
#	 示例2：建立链接link
# =================================================================
cp -l a.txt z.txt








read exits