#!/bin/sh
# author:   hoojo
# email:    hoojo_@126.com
# github:   https://github.com/hooj0
# create:   2018-07-18
# copyright by hoojo@2018



# =================================================================
#		passwd —— 让当前登录的用户更改他的密码
# =================================================================
# 超级用户用passwd 来设置或更改用户密码，普通用户也可以自己修改密码
# passwd 命令选项对超级用户有效，允许帐号锁定，密码失效
#
# passwd 命令将会试着强迫你使用“强”密码。
# 这意味着它会拒绝接受太短的密码、与先前相似的密码、 字典中的单词
# 作为密码或者是太容易猜到的密码
# -----------------------------------------------------------------




# =================================================================
#	 示例1：输入 passwd 命令，更改密码
#           shell 会提示你输入你的旧密码和你的新密码：
# =================================================================
passwd

# output:
#-------------------------------------------------------------------
# 输入新的 UNIX 密码：
# 重新输入新的 UNIX 密码：


# =================================================================
#	 示例2：
# =================================================================


# output:
#-------------------------------------------------------------------
#







read exits