#!/bin/sh
# author:   hoojo
# email:    hoojo_@126.com
# github:   https://github.com/hooj0
# create:   2018-07-08
# copyright by hoojo@2018



# =================================================================
#		grep —— 在 文件中查找文本
# =================================================================
# 在文件中查找文本。你可以用 grep 去查找匹配一个或多个正则表达式的文本行，然后输出这些行。

# 选项：
#   ”-i” 使得 grep 在执行搜索时忽略大小写（通常，搜索是大小写 敏感的），
#   ”-v”选项会告诉 grep 只打印不匹配的行。
# -----------------------------------------------------------------




# =================================================================
#	 示例1：
# =================================================================
grep admin /etc/passwd

# output:
#-------------------------------------------------------------------
# gnats:x:41:41:Gnats Bug-Reporting System (admin):/var/lib/gnats:/usr/sbin/nologin


# =================================================================
#	 示例2：你也可以通过 -i 参数强制忽略大小写。参数 -w 表示只查找单词。
#       参数-r则被用来递归地查找指定文件夹下的所有文件，例如：
# =================================================================
grep admin -iw -r /etc/

# output:
#-------------------------------------------------------------------
#/etc/pam.d/login:# and a static (admin-editable) part from /etc/motd.
#/etc/sudoers:# Members of the admin group may gain root privileges
#/etc/sudoers:%admin ALL=(ALL) ALL
#/etc/passwd:gnats:x:41:41:Gnats Bug-Reporting System (admin):/var/lib/gnats:/usr/sbin/nologin




# =================================================================
#	 示例：每行都会附上文件名，来阅读检查目录下所有文件的内容
# =================================================================
grep . *


# output:
#-------------------------------------------------------------------
#a.txt:aaa
#a.txt:bbbb
#a.txt:cccc
#a.txt:dddd
#b.txt:aaa
#b.txt:bbbb
#b.txt:cccc
#b.txt:dddd





read exits