#!/bin/sh
# author:   hoojo
# email:    hoojo_@126.com
# github:   https://github.com/hooj0
# create:   2018-10-29
# copyright by hoojo@2018



# =================================================================
#		sed —— 过滤和替换文本
# =================================================================
# 用于过滤和替换文本的流式编辑命令
# 名字 sed 是 stream editor（流编辑器）的简称。
# 它对文本流，即一系列指定的文件或标准输入进行编辑。
#
# =================================================================
# sed 地址表示法
# -----------------------------------------------------------------
# 地址 	说明
# -----------------------------------------------------------------
# n 	        行号，n 是一个正整数。
# $ 	        最后一行。
# /regexp/ 	    所有匹配一个 POSIX 基本正则表达式的文本行。注意正则表达式通过 斜杠字符界定。
#               选择性地，这个正则表达式可能由一个备用字符界定，通过\cregexpc 来 指定表达式，这里 c 就是一个备用的字符。
# addr1,addr2 	从 addr1 到 addr2 范围内的文本行，包含地址 addr2 在内。地址可能是上述任意 单独的地址形式。
# first~step 	匹配由数字 first 代表的文本行，然后随后的每个在 step 间隔处的文本行。
#               例如 1~2 是指每个位于偶数行号的文本行，5~5 则指第五行和之后每五行位置的文本行。
# addr1,+n 	    匹配地址 addr1 和随后的 n 个文本行。
# addr! 	    匹配所有的文本行，除了 addr 之外，addr 可能是上述任意的地址形式。
# =================================================================
#  sed 基本编辑命令
# -----------------------------------------------------------------
# 命令 	说明
# -----------------------------------------------------------------
# = 	输出当前的行号。
# a 	在当前行之后追加文本。
# d 	删除当前行。
# i 	在当前行之前插入文本。
# p 	打印当前行。默认情况下，sed 程序打印每一行，并且只是编辑文件中匹配 指定地址的文本行。
#       通过指定-n 选项，这个默认的行为能够被忽略。
# q 	退出 sed，不再处理更多的文本行。如果不指定-n 选项，输出当前行。
# Q 	退出 sed，不再处理更多的文本行。
# s/regexp/replacement/ 	只要找到一个 regexp 匹配项，就替换为 replacement 的内容。
#                           replacement 可能包括特殊字符 &，其等价于由 regexp 匹配的文本。
#                           另外， replacement 可能包含序列 \1到 \9，其是 regexp 中相对应的子表达式的内容。
#                           更多信息，查看 下面 back references 部分的讨论。
#                           在 replacement 末尾的斜杠之后，可以指定一个 可选的标志，来修改 s 命令的行为。
# y/set1/set2 	            执行字符转写操作，通过把 set1 中的字符转变为相对应的 set2 中的字符。
#                           注意不同于 tr 程序，sed 要求两个字符集合具有相同的长度。
# -----------------------------------------------------------------



# =================================================================
# 示例：替换文本
# =================================================================
echo "front" | sed 's/front/back/'
# 保持一致的分隔符即可满足替换
echo "front" | sed 's_front_back_'


# =================================================================
# 示例：命令添加地址 1，就导致只对仅有一行文本的输入流的第一行执行替换操作
# =================================================================
echo "front" | sed '1s/front/back/'


# =================================================================
# 示例：把 example.txt 所有空格替换为连字符并输出
# =================================================================
sed 's/ /-/g' example.txt

# output:
#-------------------------------------------------------------------
#Lorem-ipsum
#dolor-sit-amet,
#consetetur
#sadipscing-elitr,
#sed-diam-nonumy
#eirmod-tempor
#invidunt-ut-labore
#et-dolore-magna
#aliquyam-erat,-sed
#diam-voluptua.-At
#vero-eos-et
#accusam-et-justo
#duo-dolores-et-ea
#rebum.-Stet-clita
#kasd-gubergren,
#no-sea-takimata
#sanctus-est-Lorem
#ipsum-dolor-sit
#amet.



# =================================================================
# 示例：把所有a、b、c替换为 "_"
# =================================================================
sed 's/[a-c]/_/g' example.txt



# output:
#-------------------------------------------------------------------
#Lorem ipsum
#dolor sit _met,
#_onsetetur
#s_dips_ing elitr,
#sed di_m nonumy
#eirmod tempor
#invidunt ut l__ore
#et dolore m_gn_
#_liquy_m er_t, sed
#di_m voluptu_. At
#vero eos et
#___us_m et justo
#duo dolores et e_
#re_um. Stet _lit_
#k_sd gu_ergren,
#no se_ t_kim_t_
#s_n_tus est Lorem
#ipsum dolor sit
#_met.



# =================================================================
# 示例：提取1-5行的文本。
# =================================================================
# 开始于第一行，直到第五行；使用 p 命令， 其就是简单地把匹配的文本行打印出来。
# 选项 -n（不自动打印选项）， 让 sed 不要默认地打印每一行。
sed -n '1,5p' distros.txt



# =================================================================
# 示例：排除 SUSE 关键字的记录
# =================================================================
sed -n '/SUSE/!p' distros.txt


# =================================================================
# 示例：修改日期格式
# =================================================================
# ([0-9]{2})/([0-9]{2})/([0-9]{4})$ 匹配年月日
# /\3-\1-\2/ 此表达式给出了年份，一个短划线，月份，一个短划线，和某天。
sed 's/\([0-9]\{2\}\)\/\([0-9]\{2\}\)\/\([0-9]\{4\}\)$/\3-\1-\2/' distros.txt


# output:
#-------------------------------------------------------------------
# SUSE           10.2     2006-12-07
# Fedora         10       2008-11-25



# =================================================================
# 示例：s 命令的另一个功能是使用可选标志，其跟随替代字符串。可选标志是 g 标志，
# 其 指示 sed 对某个文本行全范围地执行查找和替代操作，这是默认行为
# =================================================================
# 默认 全局替换
echo "aaabbbccc" | sed 's/b/B/'

# g 全局替换
echo "aaabbbccc" | sed 's/b/B/g'