#!/bin/sh

# =================================================================
#		wc —— 输出文件中的行、单词、字符个数。
# =================================================================
# 
# -----------------------------------------------------------------



# -----------------------------------------------------------------
#   准备工作
# -----------------------------------------------------------------
cat << EOF > example.txt
Lorem ipsum dolor sit amet,
consetetur sadipscing elitr,
sed diam nonumy eirmod tempor
invidunt ut labore et dolore magna aliquyam erat,
sed diam voluptua.
At vero eos et accusam et justo duo dolores et ea rebum.
Stet clita kasd gubergren,
no sea takimata sanctus est Lorem ipsum dolor sit amet.
EOF



# =================================================================
#	 示例1：统计文件中的行、单词、字符个数
# =================================================================
wc example.txt

# output:
#-------------------------------------------------------------------
# 8  50 296 example.txt


# =================================================================
#	 示例2：统计行数
# =================================================================
wc -l example.txt

# output:
#-------------------------------------------------------------------
# 8 example.txt






read exits