#!/bin/sh

# =================================================================
#		grep —— 在 文件中查找文本
# =================================================================
# 在文件中查找文本。你可以用 grep 去查找匹配一个或多个正则表达式的文本行，然后输出这些行。
# -----------------------------------------------------------------




# =================================================================
#	 示例1：
# =================================================================
grep admin /etc/passwd

# output:
#-------------------------------------------------------------------
# gnats:x:41:41:Gnats Bug-Reporting System (admin):/var/lib/gnats:/usr/sbin/nologin


# =================================================================
#	 示例2：你也可以通过 -i 参数强制忽略大小写。参数 -w 表示只查找单词。
#       参数-r则被用来递归地查找指定文件夹下的所有文件，例如：
# =================================================================
grep admin -iw -r /etc/

# output:
#-------------------------------------------------------------------
#/etc/pam.d/login:# and a static (admin-editable) part from /etc/motd.
#/etc/sudoers:# Members of the admin group may gain root privileges
#/etc/sudoers:%admin ALL=(ALL) ALL
#/etc/passwd:gnats:x:41:41:Gnats Bug-Reporting System (admin):/var/lib/gnats:/usr/sbin/nologin







read exits