#!/bin/sh
# author:   hoojo
# email:    hoojo_@126.com
# github:   https://github.com/hooj0
# create:   2018-09-18
# copyright by hoojo@2018


# =================================================================
#		xargs – 从标准输入生成和执行命令行
# =================================================================
# 它从标准输入接受输入，并把输入转换为一个特定命令的 参数列表
# 执行带有 –show–limits 选项 的 xargs 命令，来查看命令行的最大值
# -----------------------------------------------------------------




# =================================================================
# 示例： find 命令的输出被管道到 xargs 命令，
# 之后，xargs 会为 ls 命令构建 参数列表，然后执行 ls 命令。
# =================================================================
find ~ -type f -name 'foo*' -print | xargs ls -l

# output:
#-------------------------------------------------------------------
# 


# =================================================================
# 示例：-null 保证所有文件，甚至那些文件名中包含空格的文件，都能被正确地处理
# =================================================================
find ~ -iname '*.jpg' -print0 xargs -null ls -l

# output:
#-------------------------------------------------------------------
#







read exits