#!/bin/sh

# =================================================================
#           chmod——改变文件权限
# =================================================================
# chmod 是 change mod 的意思，它用来改变文件或文件夹的读、写和执行权限。
# 详细信息参见这个链接：https://ss64.com/bash/chmod.html
# -----------------------------------------------------------------
#
# 字母' rwxXstugo ' 为受影响的用户选择新的权限：
# -----------------------------------------------------------------
# 权限	                            选项
# -----------------------------------------------------------------
# 读	                                r
# 写	                                w
# 执行（或访问目录）	                x
# 仅在文件是目录时
# 执行（或者对某些用户已具有执行权限）	    X
# 执行时设置用户或组ID	                s
# 限制删除标志或粘性位	                t
# 拥有该文件的用户当前拥有的权限	        u
# 文件组中的其他用户拥有的权限	        g
# 其他用户不在文件组中的权限         	o
# -----------------------------------------------------------------
# 用法：
#   chmod [-cfvR] [--help] [--version] mode file...
#
# 参数说明
#   mode 权限设定字串，格式如下 :
#       [ugoa...][[+-=][rwxX]...][,...]
#   其中：
#       u 表示该文件的拥有者，g 表示与该文件的拥有者属于同一个群体(group)者，o 表示其他以外的人，a 表示这三者皆是。
#       + 表示增加权限、- 表示取消权限、= 表示唯一设定权限。
#       r 表示可读取，w 表示可写入，x 表示可执行，X 表示只有当该文件是个子目录或者该文件已经被设定过为可执行。
#
# 其他参数说明：
#
#   -c : 若该文件权限确实已经更改，才显示其更改动作
#   -f : 若该文件权限无法被更改也不要显示错误讯息
#   -v : 显示权限变更的详细资料
#   -R : 对目前目录下的所有文件与子目录进行相同的权限变更(即以递回的方式逐个变更)
# -----------------------------------------------------------------




# =================================================================
#   示例1：拒绝对所有人执行权限
# =================================================================
chmod ax file



# =================================================================
#   示例2：允许所有人拥有读取权限
# =================================================================
chmod a + r file



# =================================================================
#   示例3：使组和其他人可读写文件
# =================================================================
chmod go + rw file



# =================================================================
#   示例4：使用户/所有者可执行shell脚本
# =================================================================
chmod u + x myscript.sh



# =================================================================
#   示例5：允许所有人读取，写入并执行文件，并打开设置的组ID
# =================================================================
chmod rwx,g + s file




# =================================================================
#	 示例6：添加执行权限
# =================================================================
chmod +x a.txt








read exits