#!/bin/sh

# =================================================================
#		chown——改变一个文件或者文件夹的所有者
# =================================================================
# chown 是 change owner 的意思，它用来改变一个文件或者文件夹的所有者，所有者可以是一个用户或一个用户组。
# -----------------------------------------------------------------
# 用法：
# chown [-RhLHPcvf]... USER[:[GRP]] FILE...
#
# 参数 :
#
#   user : 新的文件拥有者的使用者 ID
#   group : 新的文件拥有者的使用者群体(group)
#   -c : 若该文件拥有者确实已经更改，才显示其更改动作
#   -f : 若该文件拥有者无法被更改也不要显示错误讯息
#   -h : 只对于连结(link)进行变更，而非该 link 真正指向的文件
#   -v : 显示拥有者变更的详细资料
#   -R : 对目前目录下的所有文件与子目录进行相同的拥有者变更(即以递回的方式逐个变更)
# -----------------------------------------------------------------




# =================================================================
#	 示例1：将文件 file1.txt 的拥有者设为 users 群体的使用者 docker :
# =================================================================
chown  users:docker file1.txt

# output:
#-------------------------------------------------------------------
# 





# =================================================================
#	 示例2：将目前目录下的所有文件与子目录的拥有者皆设为 users 群体的使用者 lamport
# =================================================================
chown -R users:lamport *


# output:
#-------------------------------------------------------------------
#







read exits