#!/bin/sh
# author:   hoojo
# email:    hoojo_@126.com
# github:   https://github.com/hooj0
# create:   2018-11-01
# copyright by hoojo@2018



# =================================================================
#       fold —— 限制文件行宽
# =================================================================
# 折叠是将文本的行限制到特定的宽的过程
# -----------------------------------------------------------------
# -b或--bytes    以Byte为单位计算列宽，而非采用行数编号为单位。
# -s或--spaces                    以空格字符作为换列点。
# -w<每列行数>或--width<每列行数>    设置每列的最大行数。
# -----------------------------------------------------------------




# =================================================================
# 示例：将文本的行限制到特定的宽
# =================================================================
echo "The quick brown fox jumped over the lazy dog." | fold -w 12

# output:
#-------------------------------------------------------------------
# The quick br
# own fox jump
# ed over the
# lazy dog.


# =================================================================
# 示例：限制宽度，没有字符设置，默认是80
# =================================================================
# 设定了行宽为12个字符
# 增加的 -s 选项将让 fold 分解到最后可用的空白 字符
echo "The quick brown fox jumped over the lazy dog." | fold -w 12 -s

# output:
#-------------------------------------------------------------------
#



# =================================================================
# 示例：限制宽度，没有字符设置，默认是10
# =================================================================
fold -w 10 tmp.txt

# 以空格作为换行点
fold -w 10 -s tmp.txt

# output:
#-------------------------------------------------------------------
#2 this is
#a test
#3 Are you
#like awk
#This's a t
#est
#10 There a
#re orange,
#apple,mong
#o

