#!/bin/sh
# author:   hoojo
# email:    hoojo_@126.com
# github:   https://github.com/hooj0
# create:   2018-07-03
# copyright by hoojo@2018
# @changelog Added file curd `rm` shell command example



# =================================================================
#		rm —— 删除文件
# =================================================================
# rm 命令用来移除（删除）文件和目录
# -----------------------------------------------------------------
# 删除一个文件 rm: directory: is a directory
# 如果想删除文件夹，需要添加 r 参数，这样会递归的删除文件夹内所有内容。
# 可以使用 f 参数强制删除，略过确认环节。
# -----------------------------------------------------------------
#       选项 	                意义
# -----------------------------------------------------------------
# -i, --interactive 	在删除已存在的文件前，提示用户确认信息。 如果不指定这个选项，rm 会默默地删除文件
# -r, --recursive 	    递归地删除文件，这意味着，如果要删除一个目录，而此目录 又包含子目录，那么子目录也会被删除。要删除一个目录，必须指定这个选项。
# -f, --force 	        忽视不存在的文件，不显示提示信息。这选项覆盖了“--interactive”选项。
# -v, --verbose 	    在执行 rm 命令时，显示翔实的操作信息。
# -----------------------------------------------------------------
#       rm 实例
# -----------------------------------------------------------------
#   命令 	                运行结果
# rm file1 	            默默地删除文件
# rm -i file1 	        除了在删除文件之前，提示用户确认信息之外，和上面的命令作用一样。
# rm -r file1 dir1 	    删除文件 file1, 目录 dir1，及 dir1 中的内容。
# rm -rf file1 dir1 	同上，除了如果文件 file1，或目录 dir1 不存在的话，rm 仍会继续执行。
# -----------------------------------------------------------------




# =================================================================
# 示例：删除文件
# =================================================================
rm a.txt

# output:
#-------------------------------------------------------------------
# 


# =================================================================
# 示例：除了在删除文件之前，提示用户确认信息之外，和上面的命令作用一样。
# =================================================================
rm -i a.txt

# output:
#-------------------------------------------------------------------
#



# =================================================================
# 示例：删除文件 a.txt, 目录 examples，及 examples 中的内容(文件夹和文件)
# =================================================================
rm -r a.txt /tmp/examples

# output:
#-------------------------------------------------------------------
#



# =================================================================
# 示例：删除文件或文件夹，强制执行，不提示
# =================================================================
rm -rf a.txt /tmp/examples

# output:
#-------------------------------------------------------------------
#



# =================================================================
# 进入练习场
# =================================================================
cd .playground


# 删除符号连接文件
rm test-sym
# 查看文件是否存在
ls -l test-sym

# 删除硬连接
rm test-link
ls -l test-link

# 文件 test 的链接数从4减到3
ls -l test
# -rw-r--r-- 3 Administrator 197121 6675 Jul  2 13:59 test


# 删除源文件，“-i” 提示是否删除
rm -i test

# 被链接的源文件后，之前的链接文件将被损坏，坏的链接以闪烁的 红色文本显示
ls -l test-link test-sym2


read exits