#!/bin/sh
# author:   hoojo
# email:    hoojo_@126.com
# github:   https://github.com/hooj0
# create:   2018-09-11
# copyright by hoojo@2018



# =================================================================
#       ftp —— FTP 文件传输系统
# =================================================================
# 命令 	            描述
# -----------------------------------------------------------------
# ftp fileserver 	唤醒 ftp 程序，让它连接到 FTP 服务器，fileserver。
# anonymous 	    登录名。输入登录名后，将出现一个密码提示。一些服务器将会接受空密码，
#                   其它一些则会要求一个邮件地址形式的密码。
#                   如果是这种情况，试着输入 “user@example.com”。
# cd pub/cd_images/Ubuntu-8.04 	跳转到远端系统中，要下载文件所在的目录下，
#                               注意在大多数匿名的 FTP 服务器中，支持公共下载的文件都能在目录 pub 下找到
# ls 	            列出远端系统中的目录。
# lcd Desktop 	    跳转到本地系统中的 ~/Desktop 目录下。
#                   在实例中，ftp 程序在工作目录 ~ 下被唤醒。 这个命令把工作目录改为 ~/Desktop
# get ubuntu-8.04-desktop-i386.iso 	告诉远端系统传送文件到本地。
#                                   因为本地系统的工作目录 已经更改到了 ~/Desktop，所以文件会被下载到此目录。
# bye 	            退出远端服务器，结束 ftp 程序会话。也可以使用命令 quit 和 exit。
# -----------------------------------------------------------------




# =================================================================
#	 示例：ftp 示例
# =================================================================

# output:
#-------------------------------------------------------------------
# 


# =================================================================
#	 示例：lftp 示例，也更流行的 ftp 程序
# =================================================================


# output:
#-------------------------------------------------------------------
#







read exits