#!/bin/sh
# author:   hoojo
# email:    hoojo_@126.com
# github:   https://github.com/hooj0
# create:   2020-11-05
# copyright by hoojo@2020
# @changelog Added package `brew` shell command example




# ==========================================================================
# brew ———— macOS 或 linux 包管理器
# ==========================================================================
# brew 采用 ruby 语言编写，不用考虑依赖项简单安装程序
# 安装方法：
#   /usr/bin/ruby -e "$(curl -fsSL https://raw.githubusercontent.com/Homebrew/install/master/install)"
# --------------------------------------------------------------------------
# 搜索
#   brew search xxx 例如 brew search mysql
# 安装
#   brew install xxx 例如：brew install mysql
# 查询
#   brew info xxx 例如：brew info mysql 主要查看具体的信息及依赖关系当前版本注意事项等
# 更新
#   如果想要更新到当前最新的版本要先把当前 brew 更新到最新。
#   brew update 这个时候他会先更新自己到最新 接下来的操作才更有意义
# 检测新版本
#   brew outdated 会列出所有有新版本的程序
# 升级
#   brew upgrade 升级所有 当然也可以指定升级
#   brew upgrade xxx指定的升级的程序名
# 清理
#   brew cleanup 清理不需要的版本及其安装缓存
# 删除
#   brew uninstall xxx删除不需要的程序
# 更多命令详见
#   man brew
# --------------------------------------------------------------------------



# ==========================================================================
# 示例：
# ==========================================================================

# output:
# --------------------------------------------------------------------------
#


# ==========================================================================
# 示例：
# ==========================================================================


# output:
# --------------------------------------------------------------------------
#







read exits