#!/bin/sh
# author:   hoojo
# email:    hoojo_@126.com
# github:   https://github.com/hooj0
# create:   2020-11-06
# copyright by hoojo@2020
# @changelog Added package `dpkg` shell command example




# ==========================================================================
#       dpkg ———— Ubuntu 中安装 deb 软件包工具/底层工具
# ==========================================================================
# Linux 发行版使用不同的打包系统，Debian 的”.deb” 包管理技术阵营：
# --------------------------------------------------------------------------
# 包管理系统                 发行版 (部分列表)
# --------------------------------------------------------------------------
# Debian Style (.deb) 	    Debian, Ubuntu, Xandros, Linspire
# --------------------------------------------------------------------------
#       *.deb 包管理工具
# ==========================================================================
# 发行版 	                                底层工具 	上层工具
# --------------------------------------------------------------------------
# Debian-Style 	                            dpkg 	apt-get, apt
# --------------------------------------------------------------------------
# Ubuntu软件包格式为deb，安装方法如下：
#    sudo dpkg -i package.deb
#
# dpkg的详细使用方法，下面简单列了几个：
#   dpkg -i package.deb         安装包
#   dpkg -r package             删除包
#   dpkg -P package             删除包（包括配置文件）
#   dpkg -L package             列出与该包关联的文件
#   dpkg -l package             显示该包的版本
#   dpkg –unpack package.deb    解开 deb 包的内容
#   dpkg -S keyword             搜索所属的包内容
#   dpkg -l                     列出当前已安装的包
#   dpkg -c package.deb         列出 deb 包的内容
#   dpkg –configure package     配置包
# --------------------------------------------------------------------------



# ==========================================================================
# 示例：
# ==========================================================================

# output:
# --------------------------------------------------------------------------
#


# ==========================================================================
# 示例：
# ==========================================================================


# output:
# --------------------------------------------------------------------------
#







read exits