#!/bin/sh
# author:   hoojo
# email:    hoojo_@126.com
# github:   https://github.com/hooj0
# create:   2020-11-06
# copyright by hoojo@2020
# @changelog Added package `apt` shell command example




# ==========================================================================
#       apt ———— 包管理工具，简版 apt-get 包含常用命令
# --------------------------------------------------------------------------
# apt 将 apt-get 的常用命令集合在一个命令下，使用较为方便。在各种操作下还提供了比
# apt-get 更多可视化友好的功能。例如：提示升级软件包列表、查看可升级软件包、已经进度条
# ==========================================================================
# apt 1.2.32ubuntu0.1 (amd64)
# Usage: apt [options] command
#
# Most used commands:
#  list -       列出包名称
#  search -     搜索包
#  show -       显示包详细信息
#  install -    安装包
#  remove -     删除包
#  purge -      移除软件包及配置文件
#  autoremove - 自动删除所有未使用的包
#  update -     更新包列表
#  upgrade -    通过安装/升级包来升级系统
#  full-upgrade - 通过删除/安装/升级包来升级系统
#  edit-sources - 编辑源文件 source.list
# --------------------------------------------------------------------------



# ==========================================================================
# 示例：列出包名称
# ==========================================================================
sudo apt list

# 查看可升级的安装包
sudo apt list --upgradable



# ==========================================================================
# 示例：搜索包
# ==========================================================================
sudo apt search pkg_name



# ==========================================================================
# 示例：显示包详细信息
# ==========================================================================
sudo apt show pkg_name



# ==========================================================================
# 示例：安装包
# ==========================================================================
sudo apt install pkg_name

# 通配符安装，安装xxx开头软件包
sudo apt install pkg_name_*

# 安装多个软件包
sudo apt install pkg pkg2 pkg3

# 直接安装，无需确认
sudo apt install pkg_name -y

# 静默安装，降低日志级别
sudo apt install pkg_name -q



# ==========================================================================
# 示例：删除包
# ==========================================================================
sudo apt remove pkg_name

# 删除安装包和配置
sudo apt remove --purge pkg_name

# 通配符匹配 删除安装包
sudo apt remove --purge qt5-*



# ==========================================================================
# 示例：删除包和配置文件
# ==========================================================================
sudo apt purge pkg_name



# ==========================================================================
# 示例：自动删除所有未使用的包
# ==========================================================================
sudo apt autoremove



# ==========================================================================
# 示例：更新包列表
# ==========================================================================
sudo apt update



# ==========================================================================
# 示例：通过安装/升级包来升级系统
# ==========================================================================
sudo apt upgrade



# ==========================================================================
# 示例：通过删除/安装/升级包来升级系统
# ==========================================================================
sudo apt full-upgrade



# ==========================================================================
# 示例：编辑源文件 source.list
# ==========================================================================
sudo apt edit-sources



read exits