#!/bin/sh
# author:   hoojo
# email:    hoojo_@126.com
# github:   https://github.com/hooj0
# create:   2018-09-25
# copyright by hoojo@2018



# =================================================================
#       tar —— 归档打包工具
# =================================================================
# 归档就是收集许多文件，并把它们 捆绑成一个大文件的过程。
# 归档经常作为系统备份的一部分来使用。
# =================================================================
# tar 模式
# -----------------------------------------------------------------
# 模式 	说明
# -----------------------------------------------------------------
# c 	为文件或目录列表创建归档文件。
# x 	抽取归档文件。
# r 	追加具体的路径到归档文件的末尾。
# t 	列出归档文件的内容。
# -----------------------------------------------------------------




# =================================================================
# 示例：tar 打包归档
# =================================================================
# 模式和选项可以写在一起，而且不 需要开头的短横线。
# 注意，然而，必须首先指定模式，然后才是其它的选项。
tar cf foo.tar foo_directory

# output:
#-------------------------------------------------------------------
# 


# =================================================================
# 示例：列出归档文件的内容
# =================================================================
tar tf foo.tar

# 得到更详细的列表信息
tar tvf foo.tar

# output:
#-------------------------------------------------------------------
#


# =================================================================
# 示例：解压缩文件
# =================================================================
# 解压到当前目录
tar xf ../foo.tar
# 解压到指定目录
tar cf foo.tar ~/bar

# 将 home 目录下的内容压缩到 BigDisk 磁盘中
sudo tar cf /media/BigDisk/home.tar /home
# 加磁盘中的归档文件解压缩到当前目录
sudo tar xf /media/BigDisk/home.tar


# =================================================================
# 示例：解压缩归档文件中的某个特定目录或文件
# GNU 版本的 tar 命令（在 Linux 发行版中最常出现）通过 --wildcards 选项来 支持通配符
# -----------------------------------------------------------------
# 通过给命令添加末尾的路径名，tar 命令就只会恢复指定的文件。可以指定多个路径名。
# 注意：路径名必须是完全的，精准的相对路径名，就如存储在归档文件中的一样。
# =================================================================
tar xf archive.tar foo/bar

# 提取路径名中包含了通配符 dir-* 的文件
tar xf ../foo.tar --wildcards 'home/me/foo/dir-\*/file-A'


# =================================================================
# 示例：tar 命令结合 find 命令 制作查找特定的文件集合
# =================================================================
# 找到foo目录中的文件名为 file-A 的文件或目录，然后打包
find foo -name 'file-A' -exec tar rf foo.tar '{}' '+'

find foo -name 'file-A' | tar cf - --files-from=- | gzip > foo.tgz

# gzip = z
find foo -name 'file-A' | tar czf foo.tgz -T -
# bzip2 = j
find foo -name 'file-A' | tar cjf foo.tbz -T -


# =================================================================
# 示例：解压到当前目录
# =================================================================
# gz 文件
tar --strip-components 1 -xzf /usr/save/node-v4.2.1-linux-x64.tar.gz
# xz文件
tar --strip-components 1 -xf /usr/save/node-v4.2.1-linux-x64.tar.xz
