#!/bin/sh

# -----------------------------------------------------------------
# author:   hoojo
# email:    hoojo_@126.com
# github:   https://github.com/hooj0
# create:   2020-10-27
# copyright by hoojo@2020
# =================================================================
#           二进制文件编译和安装
# =================================================================
# 配置安装目录
#       ./configure --prefix=/usr/local/python3.7 # (设置python3.7.3的安装路径)
#
# 编译 并安装
#       make
#       make install
# -----------------------------------------------------------------




# =================================================================
# 示例： 安装 二进制 python
# =================================================================
# 一、先安装需要的包zlib1g,libffi
# 更新 软件源 metadata 列表
apt-get update
# 通过更新后的列表中选择安装 对应版本的软件
apt-get install zlib1g-dev
apt-get install libffi-dev

# 二、在ubuntu上创建/usr/local/python3.7的目录，将压缩包放到该目录
mkdir -p /usr/local/python3.7

# 把压缩包放进去
cd /usr/local/python3.7
tar -zxvf Python-3.7.3.tgz
cd Python-3.7.3

# 配置安装目录
./configure --prefix=/usr/local/python3.7 # (设置python3.7.3的安装路径)

# 编译 并安装
make
make install


# output:
#-------------------------------------------------------------------
# 


# =================================================================
# 示例：
# =================================================================


# output:
#-------------------------------------------------------------------
#







read exits