#!/bin/sh
# -----------------------------------------------------------------
# author:   hoojo
# email:    hoojo_@126.com
# github:   https://github.com/hooj0
# create date: 2018-06-28
# copyright by hoojo @ 2018
# -----------------------------------------------------------------


# =================================================================
#   快捷键         描述
# -----------------------------------------------------------------
#   Tab         键实现自动补全
#   ctrl-r      搜索命令行历史记录
#   ctrl-w      删除你键入的最后一个单词
#   ctrl-u      删除行内光标所在位置之前的内容
#   alt-f       以单词为单位向后移动光标
#   alt-b       以单词为单位向前移动光标
#   ctrl-a      将光标移至行首
#   ctrl-e      将光标移至行尾
#   ctrl-k      删除光标至行尾的所有内容
#   ctrl-l      清屏
# -----------------------------------------------------------------

# 可以执行 set -o vi 来使用 vi 风格的快捷键，而执行 set -o emacs 可以把它改回来






