#!/bin/bash
# author:   hoojo
# email:    hoojo_@126.com
# github:   https://github.com/hooj0
# create date: 2018-11-12
# copyright by hoojo@2018



# =================================================================
#       vim 配置
# =================================================================
# 通过把这些命令（没有开头的冒号字符）添加到你的 ~/.vimrc 文件中
# -----------------------------------------------------------------

# 打开语法高亮，不同的 shell 语法元素会以不同的颜色 显示。
:syntax on

# 如果对于上面的命令，你遇到了困难，试试 
:set syntax=sh

# 打开这个选项是为了高亮查找结果
:set hlsearch

# 设置一个 tab 字符所占据的列数。默认是8列。把这个值设置为4
:set tabstop=4

# 打开 “auto indent” 功能。这导致 vim 能对新的文本行缩进与刚输入的文本行相同的列数
:set autoindent