#!/bin/sh
# author:   hoojo
# email:    hoojo_@126.com
# github:   https://github.com/hooj0
# create:   2018-08-14
# copyright by hoojo@2018



# =================================================================
#		ping —— 测试网络连接
# =================================================================
# ping 某个主机然后输出结果
# ping 命令发送一个特殊的网络数据包，叫做 ICMP ECHO_REQUEST，到 一台指定的主机。
# 大多数接收这个包的网络设备将会回复它，来允许网络连接验证。
#
# 注意：大多数网络设备（包括 Linux 主机）都可以被配置为忽略这些数据包。
# 通常，这样做是出于网络安全 原因，部分地遮蔽一台主机免受一个潜在攻击者地侵袭。
# 配置防火墙来阻塞 IMCP 流量也很普遍。
# -----------------------------------------------------------------




# =================================================================
#	 示例1：ping ip 地址
# =================================================================
ping 127.0.0.1

# output:
#-------------------------------------------------------------------
#PING 127.0.0.1 (127.0.0.1) 56(84) bytes of data.
#64 bytes from 127.0.0.1: icmp_seq=1 ttl=64 time=0.107 ms
#64 bytes from 127.0.0.1: icmp_seq=2 ttl=64 time=0.041 ms
#64 bytes from 127.0.0.1: icmp_seq=3 ttl=64 time=0.045 ms


# =================================================================
#	 示例2： ping 域名
# =================================================================
# -c count 请求次数
ping -c 2 www.baidu.com


# output:
#-------------------------------------------------------------------
#




# =================================================================
#	 示例：traceroute 程序（一些系统使用相似的 tracepath 程序来代替）跟踪路由
# 会显示从本地到指定主机 要经过的所有“跳数”的网络流量列表。
# =================================================================
# 例如，看一下到达 baidu.com 需要经过的路由
traceroute baidu.com

# output:
#-------------------------------------------------------------------
#






read exits