#!/bin/sh
# author:   hoojo
# email:    hoojo_@126.com
# github:   https://github.com/hooj0
# create:   2018-08-09
# copyright by hoojo@2018




# =================================================================
#		dd —— 文件或设备间传输数据
# =================================================================
# 把数据块从一个地方复制到另一个地方
#
# 语法：
#   dd if=input_file of=output_file [bs=block_size [count=blocks]]
# -----------------------------------------------------------------




# =================================================================
#	 示例：将软盘 A 的文件移动到软盘 B
#
# 比方说我们有两个相同容量的 USB 闪存驱动器，并且要精确地把第一个驱动器（中的内容） 复制给第二个。
# 如果连接两个设备到计算机上，它们各自被分配到设备/dev/sdb 和 /dev/sdc 上，
# 这样我们就能通过下面的命令把第一个驱动器中的所有数据复制到第二个 驱动器中。
# =================================================================
dd if=/dev/sdb of=/dev/sdc


# output:
#-------------------------------------------------------------------
# 


# =================================================================
#	 示例：移动设备数据到普通文件设备中
#
# 如果只有第一个驱动器被连接到计算机上，
# 可以把它的内容复制到一个普通文件中供以后恢复或复制数据
# =================================================================
dd if=/dev/sdb of=flash_drive.img


# output:
#-------------------------------------------------------------------
#







read exits