#!/bin/sh
# author:   hoojo
# email:    hoojo_@126.com
# github:   https://github.com/hooj0
# create:   2018-09-25
# copyright by hoojo@2018
# @changelog Added file `rsync` shell command example



# =================================================================
#       rsync —— 同步文件或目录
# =================================================================
# 可以同步两个文件或者目录，保证它们的数据一致性。
#
# 语法：rsync options source destination
#
#    一个本地文件或目录
#    一个远端文件或目录，以[user@]host:path 的形式存在
#    一个远端 rsync 服务器，由 rsync://[user@]host[:port]/path 指定
# -----------------------------------------------------------------




# =================================================================
# 示例：同步 playground 目录和它在 foo 目录中相对应的副本
# =================================================================
# -a 选项（递归和保护文件属性）
# -v 选项（冗余输出）
rsync -av playground foo

# output:
#-------------------------------------------------------------------
# sent 135759 bytes received 57870 bytes 387258.00 bytes/sec
# total size is 3230 speedup is 0.02


# =================================================================
# 示例：把/etc，/home，和/usr/local 目录从我们的系统中复制到想存储设备中
# –delete 这个选项，来删除可能在备份设备中已经存在但却不再存在于源设备中的文件
# （这与我们第一次创建备份无关，但是会在随后的复制操作中有用途）
# =================================================================
sudo rsync -av --delete /etc /home /usr/local /media/BigDisk/backup

# output:
#-------------------------------------------------------------------
#


# =================================================================
# 示例：同步文件到 远程系统中有一个名为/backup 的目录
# =================================================================
# --rsh=ssh 选项，其指示 rsync 使用 ssh 程序作为它的远程 shell
# 在目标路径名前加上远端主机的名字（在这种情况下， 远端主机名为 remote-sys），来指定远端主机
sudo rsync -av --delete --rsh=ssh /etc /home /usr/local remote-sys:/backup





read exits