#!/bin/sh
# author:   hoojo
# email:    hoojo_@126.com
# github:   https://github.com/hooj0
# create:   2018-07-06
# copyright by hoojo@2018




# =================================================================
#       IO —— 标准输入重定向
# =================================================================
# cat < file.txt
# 使用 “<” 重定向操作符，把标准输入源从键盘改到文件 file.txt。
# 说明把一个文件作为标准输入源。
#
# 我们看到结果 和 传递单个文件名作为参数的执行结果一样。
# -----------------------------------------------------------------




# =================================================================
#	 示例：标准输入重定向，将文件从标准输入重定向
# =================================================================
cat < lazy-file.txt

# output:
#-------------------------------------------------------------------
# 


# =================================================================
#	 示例： 管道线
#    管道操作符 ”|”，一个命令的标准输出可以通过管道送至另一个命令的标准输入：
#       command1 | command2
# =================================================================
# 用 less 来一页一页地显示命令的输出
ls -l /usr/bin | less

# output:
#-------------------------------------------------------------------
#



# =================================================================
#	 示例：过滤器，把几个命令放在一起组成一个管道线
# =================================================================
ls /bin /usr/bin | sort | less

# 忽略重复行
ls /bin /usr/bin | sort | uniq | less

# 显示重复行
ls /usr/bin/ /bin/ | sort | uniq -d | less

# 统计命令个数
ls /bin /usr/bin | sort | uniq | wc -l

# 显示最后5个命令
ls /usr/bin | tail -n 5

# 查找特定字符串
ls /bin /usr/bin | sort | uniq | grep zip


# output:
#-------------------------------------------------------------------
#




read exits