#!/bin/sh
# author:   hoojo
# email:    hoojo_@126.com
# github:   https://github.com/hooj0
# create:   2018-09-11
# copyright by hoojo@2018
# @changelog system download file tools `wget` command example




# =============================================================================
#		wget —— 下载文件
# =============================================================================
# 格式：wget [选项]  [参数]
#   其中参数为：URL地址
#
# 其中选项如下：
#    -a <日志文件>：在指定的日志文件中记录资料的执行过程
#    -A <后缀名>：指定要下载文件的后缀名，多个后缀名之间使用逗号进行分隔
#    -b：进行后台的方式运行wget
#    -B <连接地址>：设置参考的连接地址的基地地址
#    -c：继续执行上次终端的任务
#    -C <标志>：设置服务器数据块功能标志on为激活，off为关闭，默认值为on
#    -d：调试模式运行指令
#    -D <域名列表>：设置顺着的域名列表，域名之间用“，”分隔
#    -e <指令>：作为文件“.wgetrc”中的一部分执行指定的指令
#    -h：显示指令帮助信息
#    -i <文件>：从指定文件获取要下载的URL地址
#    -l <目录列表>：设置顺着的目录列表，多个目录用“，”分隔
#    -L：仅顺着关联的连接
#    -r：递归下载方式
#    -nc：文件存在时，下载文件不覆盖原有文件；
#    -nv：下载时只显示更新和出错信息，不显示指令的详细执行过程
#    -q：不显示指令执行过程
#    -nh：不查询主机名称
#    -v：显示详细执行过程
#    -V：显示版本信息
#    --passive-ftp：使用被动模式PASV连接FTP服务器
#    --follow-ftp：从HTML文件中下载FTP连接文件
# -----------------------------------------------------------------------------




# =============================================================================
# 示例： 下载文件，保存在当前目录
# -----------------------------------------------------------------------------
# 在下载的过程中会显示进度条（下载完成百分比，已经下载的字节，当前下载速度，剩余下载时间）
# =============================================================================
wget http://www.xxx.cn/readMe.txt


# output:
# -----------------------------------------------------------------------------
#


# =============================================================================
# 示例： 下载文件不存储，-O 不设置文件名不保存
# =============================================================================
wget http://www.xxx.cn/readMe.txt -O -
# 设置超时
wget http://www.xxx.cn/readMe.txt -T 3 -O -
# 设置 user-agent
wget -U mozilla http://www.xxx.cn/readMe.txt -T 3 -O -


# output:
# -----------------------------------------------------------------------------
#



# =============================================================================
# 示例：以不同的文件名保存
# -----------------------------------------------------------------------------
# wget 默认会以最后一个符合 ”/” 的后面的字符来命名，对于动态链接的下载通常文件名会不正确
# =============================================================================
# 错误：下面的例子会下载一个文件并以名称download.php?id=1080保存
# 即使下载的文件是zip格式，它仍然以download.php?id=1080命名
wget http://www.centos.bz/download?id=1


# 正确：为了解决这个问题，可以使用参数 -O 来指定一个文件名：
wget -O wordpress.zip http://www.centos.bz/download.php?id=1080


# =============================================================================
# 示例： 限速下载文件
# =============================================================================
wget --limit-rate=300k http://www.xxx.cn/readMe.txt



# =============================================================================
# 示例： 支持断点续传
# =============================================================================
wget -c http://www.xxx.cn/readMe.txt



# =============================================================================
# 示例： 后台下载文件
# =============================================================================
wget -b http://www.xxx.cn/readMe.txt


# =============================================================================
# 示例： 测试下载链接
# =============================================================================
wget --spider http://www.xxx.cn/readMe.txt



read exits