#!/bin/sh
# author:   hoojo
# email:    hoojo_@126.com
# github:   https://github.com/hooj0
# create:   2018-09-11
# copyright by hoojo@2018
# @changelog system download file tools `wget` command example




# =============================================================================
#		wget —— 下载文件
# =============================================================================
# wget是在Linux下开发的开放源代码的软件，作者是Hrvoje Niksic，
# 后来被移植到包括Windows在内的各个平台上。
#
# 它有以下功能和特点：
#
# （1）支持断点下传功能；这也是网络蚂蚁和FlashGet当年最大的卖点，
#     现在，Wget也可以使用此功能，那些网络不是太好的用户可以放心了
# （2）同时支持FTP和HTTP下载方式；尽管现在大部分软件可以使用HTTP方式下载，
#     但有时候，仍然需要使用FTP方式下载软件
# （3）支持代理服务器；对安全强度很高的系统而言，一般不会将自己的系统直接暴露在互联网上，
#     所以，支持代理是下载软件必须有的功能
# （4）设置方便简单；可能习惯图形界面的用户已经不是太习惯命令行了，
#     但命令行在设置上其实有更多的优点
# （5）程序小，完全免费；
# -----------------------------------------------------------------------------
# 格式：wget [选项]  [参数]
#   其中参数为：URL地址
#
# 其中选项如下：
#    -a <日志文件>：在指定的日志文件中记录资料的执行过程
#    -A <后缀名>：指定要下载文件的后缀名，多个后缀名之间使用逗号进行分隔
#    -b：进行后台的方式运行wget
#    -B <连接地址>：设置参考的连接地址的基地地址
#    -c：继续执行上次终端的任务
#    -C <标志>：设置服务器数据块功能标志on为激活，off为关闭，默认值为on
#    -d：调试模式运行指令
#    -D <域名列表>：设置顺着的域名列表，域名之间用“，”分隔
#    -e <指令>：作为文件“.wgetrc”中的一部分执行指定的指令
#    -h：显示指令帮助信息
#    -i <文件>：从指定文件获取要下载的URL地址
#    -l <目录列表>：设置顺着的目录列表，多个目录用“，”分隔
#    -L：仅顺着关联的连接
#    -r：递归下载方式
#    -nc：文件存在时，下载文件不覆盖原有文件；
#    -nv：下载时只显示更新和出错信息，不显示指令的详细执行过程
#    -q：不显示指令执行过程
#    -nh：不查询主机名称
#    -v：显示详细执行过程
#    -V：显示版本信息
#    --passive-ftp：使用被动模式PASV连接FTP服务器
#    --follow-ftp：从HTML文件中下载FTP连接文件
#
#   -e,–execute=COMMAND 执行一个 “.wgetrc”命令
#
#   -o,–output-file=FILE 将软件输出信息保存到文件；
#   -a,–append-output=FILE将软件输出信息追加到文件；
#   -d,–debug显示输出信息；
#   -q,–quiet 不显示输出信息；
#   -i,–input-file=FILE 从文件中取得URL；
#
#   -t,–tries=NUMBER 是否下载次数（0表示无穷次）
#   -O –output-document=FILE下载文件保存为别的文件名
#   -nc, –no-clobber 不要覆盖已经存在的文件
#   -N,–timestamping只下载比本地新的文件
#   -T,–timeout=SECONDS 设置超时时间
#   -Y,–proxy=on/off 关闭代理
#
#   -nd,–no-directories 不建立目录
#   -x,–force-directories 强制建立目录
#
#   –http-user=USER设置HTTP用户
#   –http-passwd=PASS设置HTTP密码
#   –proxy-user=USER设置代理用户
#   –proxy-passwd=PASS设置代理密码
#
#   -r,–recursive 下载整个网站、目录（小心使用）
#   -l,–level=NUMBER 下载层次
#
#   -A,–accept=LIST 可以接受的文件类型
#   -R,–reject=LIST拒绝接受的文件类型
#   -D,–domains=LIST可以接受的域名
#   –exclude-domains=LIST拒绝的域名
#   -L,–relative 下载关联链接
#   –follow-ftp 只下载FTP链接
#   -H,–span-hosts 可以下载外面的主机
#   -I,–include-directories=LIST允许的目录
#   -X,–exclude-directories=LIST 拒绝的目录
# -----------------------------------------------------------------------------




# =============================================================================
# 示例： 下载文件，保存在当前目录
# -----------------------------------------------------------------------------
# 在下载的过程中会显示进度条（下载完成百分比，已经下载的字节，当前下载速度，剩余下载时间）
# =============================================================================
wget http://www.xxx.cn/readMe.txt


# output:
# -----------------------------------------------------------------------------
#


# =============================================================================
# 示例： 下载文件不存储，-O 不设置文件名不保存
# =============================================================================
wget http://www.xxx.cn/readMe.txt -O -
# 设置超时
wget http://www.xxx.cn/readMe.txt -T 3 -O -
# 设置 user-agent
wget -U mozilla http://www.xxx.cn/readMe.txt -T 3 -O -



# =============================================================================
# 示例：以不同的文件名保存
# -----------------------------------------------------------------------------
# wget 默认会以最后一个符合 ”/” 的后面的字符来命名，对于动态链接的下载通常文件名会不正确
# =============================================================================
# 错误：下面的例子会下载一个文件并以名称download.php?id=1080保存
# 即使下载的文件是zip格式，它仍然以download.php?id=1080命名
wget http://www.centos.bz/download?id=1


# 正确：为了解决这个问题，可以使用参数 -O 来指定一个文件名：
wget -O wordpress.zip http://www.centos.bz/download.php?id=1080


# =============================================================================
# 示例： 下载多个文件
# =============================================================================
# 保存一份下载链接文件
cat > filelist.txt
url1
url2
url3
url4

# 接着使用文件和参数 -i 下载
wget -i filelist.txt


# =============================================================================
# 示例： 限速下载文件
# =============================================================================
wget --limit-rate=300k http://www.xxx.cn/readMe.txt


# =============================================================================
# 示例： 支持断点续传
# -----------------------------------------------------------------------------
# 使用 wget -c 重新启动下载中断的文件
# =============================================================================
# 对于下载大文件时突然由于网络等原因中断非常有帮助，可以继续接着下载而不是重新下载一个文件
wget -c http://www.xxx.cn/readMe.txt

# output:
# -----------------------------------------------------------------------------
# Continuing in background, pid 1840.
# Output will be written to `wget-log’.

# 可以使用以下命令来察看下载进度
tail -f wget-log


# =============================================================================
# 示例： 后台下载文件
# =============================================================================
wget -b http://www.xxx.cn/readMe.txt


# =============================================================================
# 示例： 测试下载链接
# =============================================================================
wget --spider http://www.xxx.cn/readMe.txt


# =============================================================================
# 示例：设置user-agent
# =============================================================================
wget –user-agent=”Mozilla/5.0 (Windows; U; Windows NT 6.1; en-US) AppleWebKit/534.16 (KHTML, like Gecko) Chrome/10.0.648.204 Safari/534.16″  http://www.xxx.cn/readMe.txt


# =============================================================================
# 示例：增加重试次数
# =============================================================================
# 如果网络有问题或下载一个大文件也有可能失败
# wget默认重试20次连接下载文件。如果需要，你可以使用–tries增加重试次数
wget –tries=40 http://www.xxx.cn/readMe.txt


# =============================================================================
# 示例：使用镜像网站
# =============================================================================
# 下载整个网站到本地
# –miror            开户镜像下载
# -p                下载所有为了html页面显示正常的文件
# –convert-links    下载后，转换成本地的链接
# -P ./LOCAL        保存所有文件和目录到本地指定目录
wget –mirror -p –convert-links -P ./LOCAL http://www.xxx.cn


# =============================================================================
# 示例：下载过滤指定格式
# =============================================================================
# 下载一个网站，但不希望下载图片，可以使用以下命令
wget –reject=gif http://www.xxx.cn


# =============================================================================
# 示例：下载信息存入日志文件
# =============================================================================
# 不希望下载信息直接显示在终端而是在一个日志文件
wget -o download.log http://www.xxx.cn


# =============================================================================
# 示例：限制总下载文件大小
# =============================================================================
# 注意：这个参数对单个文件下载不起作用，只能递归下载时才有效
wget -Q5m -i filelist.txt


# =============================================================================
# 示例：下载指定格式文件
# =============================================================================
# 可以在以下情况使用该功能

# 下载一个网站的所有图片
# 下载一个网站的所有视频
# 下载一个网站的所有PDF文件
wget -r -A.pdf http://www.xxx.cn


# =============================================================================
# 示例：使用wget FTP下载
# =============================================================================
# wget 匿名 ftp 下载

wget ftp-url

# 使用 wget 用户名和密码认证的 ftp 下载
wget –ftp-user=USERNAME –ftp-password=PASSWORD ftp://www.xxx.cn/





read exits